Config/InformationRegisters/ПодключенныеПодпискиГИСГМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПодключенныеПодпискиГИСГМП</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодпискаАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодпискиГИСГМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПодписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ПараметрыПодписокГИСГМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыПодписокГИСГМП</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрАктивен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодпискиГИСГМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПодписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторГруппыПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/ПодпискиГИСГМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодпискиГИСГМП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>subscriptionName</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодписки</Name>
					<Comment>subscriptionOperation</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержимоеФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПодписки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодПараметра</Name>
							<Comment>parameterCode </Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Comment>parameterName </Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматПараметра</Name>
							<Comment>parameterPattern </Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Comment>required </Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеДопОграничений</Name>
							<Comment>parameterDescription </Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/ПодключенныеПодпискиГИСГМП/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = Истина;
	
	ДобавитьРеквизитыТаблицыПоПараметрамПодписки();
	
	Таблица = РеквизитФормыВЗначение("ТаблицаЗначенийПараметров");
	Таблица.Индексы.Добавить("КлючСтроки");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыПодписокГИСГМПСрезПоследних.ИдентификаторГруппыПараметров КАК ИдентификаторГруппыПараметров,
		|	ПараметрыПодписокГИСГМПСрезПоследних.КодПараметра КАК КодПараметра,
		|	ПараметрыПодписокГИСГМПСрезПоследних.ЗначениеПараметра КАК ЗначениеПараметра,
		|	ПараметрыПодписокГИСГМПСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ПараметрыПодписокГИСГМП.СрезПоследних КАК ПараметрыПодписокГИСГМПСрезПоследних
		|ГДЕ
		|	ПараметрыПодписокГИСГМПСрезПоследних.Организация = &Организация
		|	И ПараметрыПодписокГИСГМПСрезПоследних.Подписка = &Подписка
		|	И ПараметрыПодписокГИСГМПСрезПоследних.ПараметрАктивен
		|	И ПараметрыПодписокГИСГМПСрезПоследних.ИдентификаторПодписки = &ИдентификаторПодписки";
	
	Запрос.УстановитьПараметр("ИдентификаторПодписки", Запись.ИдентификаторПодписки);
	Запрос.УстановитьПараметр("Организация", Запись.Организация);
	Запрос.УстановитьПараметр("Подписка", Запись.Подписка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЧ = Таблица.Найти(ВыборкаДетальныеЗаписи.ИдентификаторГруппыПараметров,"КлючСтроки");
		Если СтрокаТЧ = Неопределено Тогда
			СтрокаТЧ = Таблица.Добавить();
			СтрокаТЧ.КлючСтроки = ВыборкаДетальныеЗаписи.ИдентификаторГруппыПараметров;
			СтрокаТЧ.Период = ВыборкаДетальныеЗаписи.Период;
		КонецЕсли;
		
		СтрокаТЧ[ВыборкаДетальныеЗаписи.КодПараметра] = ВыборкаДетальныеЗаписи.ЗначениеПараметра;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Таблица,"ТаблицаЗначенийПараметров");

	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыТаблицыПоПараметрамПодписки()
	
	ИмяПоляТаблицыФормы = "ТаблицаЗначенийПараметров";
	
	УдаляемыеРеквизиты = Новый Массив;
	Таблица = РеквизитФормыВЗначение(ИмяПоляТаблицыФормы);
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Если Колонка.Имя = "КлючСтроки"
			ИЛИ Колонка.Имя = "Период" Тогда
			Продолжить;
		КонецЕсли;
		УдаляемыеРеквизиты.Добавить(ИмяПоляТаблицыФормы+"."+Колонка.Имя);
		СтарыйЭлемент = Элементы.Найти(ИмяПоляТаблицыФормы + Колонка.Имя);
		Если СтарыйЭлемент <> Неопределено Тогда
			Элементы.Удалить(СтарыйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ТипСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(50);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодпискиГИСГМППараметрыПодписки.Ссылка КАК Ссылка,
		|	ПодпискиГИСГМППараметрыПодписки.НомерСтроки КАК НомерСтроки,
		|	ПодпискиГИСГМППараметрыПодписки.КодПараметра КАК КодПараметра,
		|	ПодпискиГИСГМППараметрыПодписки.НаименованиеПараметра КАК НаименованиеПараметра,
		|	ПодпискиГИСГМППараметрыПодписки.ФорматПараметра КАК ФорматПараметра,
		|	ПодпискиГИСГМППараметрыПодписки.Обязательный КАК Обязательный,
		|	ПодпискиГИСГМППараметрыПодписки.ОписаниеДопОграничений КАК ОписаниеДопОграничений
		|ИЗ
		|	Справочник.ПодпискиГИСГМП.ПараметрыПодписки КАК ПодпискиГИСГМППараметрыПодписки
		|ГДЕ
		|	ПодпискиГИСГМППараметрыПодписки.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Запись.Подписка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ВыборкаДетальныеЗаписи.КодПараметра, ТипСтрока, ИмяПоляТаблицыФормы, ВыборкаДетальныеЗаписи.НаименованиеПараметра, Истина));
	КонецЦикла;
		
	ИзменитьРеквизиты(ДобавляемыеРеквизиты,УдаляемыеРеквизиты);
	
	ВыборкаДетальныеЗаписи.Сбросить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЭлементРеквизита					= Элементы.Добавить(ИмяПоляТаблицыФормы + ВыборкаДетальныеЗаписи.КодПараметра, Тип("ПолеФормы"), Элементы.ТаблицаЗначенийПараметров);
        ЭлементРеквизита.ПутьКДанным		= ИмяПоляТаблицыФормы + "." + ВыборкаДетальныеЗаписи.КодПараметра;
        ЭлементРеквизита.Вид				= ВидПоляФормы.ПолеВвода;
		ЭлементРеквизита.АвтоОтметкаНезаполненного = ВыборкаДетальныеЗаписи.Обязательный;
		
    КонецЦикла;
КонецПроцедуры
